# ИНСТРУКЦИЯ ДЛЯ УСТАНОВКИ И НАСТРОЙКИ СПО APACHE NiFi (версия 2.5.0)

### 1.1 Подготовка утилит

Установите необходимые утилиты для загрузки, распаковки и редактирования конфигураций:

~~~bash
# Обновление системы
sudo zypper refresh
sudo zypper update -y

# Установка базовых утилит
sudo zypper install -y wget unzip tar gzip nano curl procps
~~~

> 💡 **Примечание:**  
> - В МОС.ОС используется пакетный менеджер `zypper` (аналог `dnf` в RHEL или `apt` в Debian).  
> - Утилиты `nano`, `wget`, `unzip` — необходимы для скачивания дистрибутива и редактирования конфигурационных файлов.


### 1.3 Установка OpenJDK 21

Apache NiFi 2.5.0 требует **Java 21**. В системе доступен пакет `java-21-openjdk` из репозитория.

#### 1. Обновите список пакетов

```bash
sudo zypper refresh
```

#### 2. Установите OpenJDK 21

Рекомендуется установить:
- `java-21-openjdk-headless` — JVM без GUI
- `java-21-openjdk-devel` — инструменты разработки (javac, jstat и др.)

```bash
sudo zypper install java-21-openjdk-devel java-21-openjdk-headless
```

> 💡 Пакеты предоставлены в рамках **АТ (Астра Технологии)** — версия `21.0.3.0-at154.1.1`.

#### 3. Проверьте установку

```bash
java -version
javac -version
```

Ожидаемый вывод:
```
openjdk version "21.0.3" 2024-04-16
OpenJDK Runtime Environment AstraLinux (build 21.0.3+0-154)
OpenJDK 64-Bit Server VM AstraLinux (build 21.0.3+0-154, mixed mode)
```

#### 4. Настройка JAVA_HOME

Найдите путь к JDK:

```bash
readlink -f $(which java)
# Пример вывода: /usr/lib64/jvm/java-21-openjdk/bin/java
```

Используйте родительский каталог как `JAVA_HOME`.

Создайте скрипт окружения:

```bash
sudo nano /etc/profile.d/java.sh
```

Добавьте:

```bash
export JAVA_HOME=/usr/lib64/jvm/java-21-openjdk
export PATH=$JAVA_HOME/bin:$PATH
```

Примените:

```bash
source /etc/profile.d/java.sh
```

> ✅ Проверьте:
> ```bash
> echo $JAVA_HOME
> ```
